# SetDefOpacityByClsN

```pascal
PROCEDURE SetDefOpacityByClsN(
				inIsPenOpacityByClass  : BOOLEAN;
				inIsFillOpacityByClass : BOOLEAN);
```

```python
def vs.SetDefOpacityByClsN(inIsPenOpacityByClass, inIsFillOpacityByClass):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inIsPenOpacityByClass|BOOLEAN|   |
|inIsFillOpacityByClass|BOOLEAN|   |

## Examples
```pascal
SetDefOpacityByClsN(TRUE, FALSE);
```
```python
import vs

inIsPenOpacityByClass = True
inIsFillOpacityByClass = True

vs.SetDefOpacityByClsN(inIsPenOpacityByClass, inIsFillOpacityByClass)
```

## Version
Availability: from Vectorworks 2017

## Category
* Document Attributes